[
  {
    "id": 1,
    "role": "FrontEnd Developer",
    "organisation": "Personal Project",
    "client": "E-commerce Website",
    "location": "Remote",
    "responsibilities": [
      {
        "description": "Developed a responsive e-commerce website using React and CSS, enhancing user experience and increasing customer engagement."
      },
      {
        "description": "Implemented state management using React Hooks for managing user cart and payment options, ensuring a seamless shopping experience."
      },
      {
        "description": "Designed and integrated a secure payment options page with multiple payment methods, improving user choice and flexibility."
      },
      {
        "description": "Created a responsive navigation bar with React Router for intuitive user navigation across product categories."
      },
      {
        "description": "Established comprehensive error handling and user feedback mechanisms to enhance user experience during form submissions and payment processes."
      }
    ],

     "websiteLink": "https://mohammed2327.github.io/E-Commerce/",
    "sourceCodeLink": "https://github.com/Mohammed2327/E-Commerce"
  },



  {
    "id": 2,
    "role": "FrontEnd Developer",
    "organisation": "Personal Project",
    "client": "Portfolio Website",
    "location": "Remote",
    "responsibilities": [
      {
        "description": "Developed and maintained responsive and visually appealing websites using HTML, CSS, and JavaScript, ensuring cross-browser compatibility and adherence to web standards."
      },
      {
        "description": "Implemented CSS frameworks such as Bootstrap to enhance the design and responsiveness of web applications."
      },
      {
        "description": "Created interactive web applications by implementing JavaScript functionalities, including form validation, dynamic content loading, and event handling to improve user engagement."
      },
      {
        "description": "Optimized web pages for speed and performance by minimizing HTTP requests, compressing images, and utilizing caching techniques, resulting in faster load times and improved user experience."
      },
      {
        "description": "Utilized Git for version control to manage code changes and collaborate effectively with other developers, ensuring a smooth workflow and code integrity."
      }
    ],

     "websiteLink": "https://mohammed2327.github.io/My-Portfolio/",
    "sourceCodeLink": "https://github.com/Mohammed2327/My-Portfolio"
  },

  {
    "id": 3,
    "role": "FrontEnd Developer",
    "organisation": "Personal Project",
    "client": "Financial Dashboard",
    "location": "Remote",
    "responsibilities": [
      {
        "description": "Designed and implemented a responsive user interface for a financial dashboard using React, ensuring a seamless user experience across various devices. This included creating components for profile settings, transaction history, and visual data representations."
      },
      {
        "description": "Utilized React's state management features (useState and useEffect hooks) to manage user data, form inputs, and dynamic content updates, ensuring that the application responds efficiently to user interactions and data changes."
      },
      {
        "description": "Developed robust form validation logic to ensure data integrity during user input, providing real-time feedback on errors (e.g., invalid email formats and password strength) to enhance user experience and prevent submission of incorrect data."
      },
      {
        "description": "Integrated data visualization libraries (e.g., Recharts) to create interactive charts and graphs that display financial statistics, such as balance history and expense breakdowns, enabling users to gain insights into their financial activities at a glance."
      },
      {
        "description": "Implemented functionality for users to upload and update their profile pictures, utilizing the File API to handle image uploads and display them dynamically within the application, enhancing personalization."
      },
      {
        "description": "Established a clear navigation structure using React Router, allowing users to switch between different sections of the dashboard (e.g., settings, transactions, and account details) effortlessly, thereby improving overall usability and accessibility of the application."
      }
    ],

     "websiteLink": "https://financial-dashboard3.netlify.app/",
    "sourceCodeLink": "https://github.com/Mohammed2327/Financial-Dashboard.git"
  }


]